TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствиеОбъектовWarehouse/гкс_СоответствиеОбъектовWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствиеОбъектовWarehouse</name>
  <resources>
    <name>СсылкаИБ</name>
    <type>
      <types>DefinedType.гкс_WarehouseСинхронизируемыеСсылки</types>
    </type>
  </resources>
  <dimensions>
    <name>СсылкаWarehouse</name>
    <type>
      <types>DefinedType.гкс_WarehouseСправочники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыОбъектовWarehouse/гкс_ТипыОбъектовWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыОбъектовWarehouse</name>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Станция</name>
  </enumValues>
  <enumValues>
    <name>Сюрвейер</name>
  </enumValues>
  <enumValues>
    <name>Элеватор</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствиеОбъектовWarehouse/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаИБНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПолеОформления = Элементы.СсылкаИБ;
	
	ОписаниеТипаСсылкиИБ = ОписаниеТипаСсылкиИБ(Запись.СсылкаWarehouse);	
	Если ЗначениеЗаполнено(ОписаниеТипаСсылкиИБ) Тогда
		ПолеОформления.ОграничениеТипа = ОписаниеТипаСсылкиИБ;	
		ПолеОформления.ВыбиратьТип = Ложь;
	Иначе	
		ПолеОформления.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОписаниеТипаСсылкиИБ(СсылкаWarehouse)
	
	Результат =  Неопределено;
	ТипСсылкиWarehouse = ТипЗнч(СсылкаWarehouse);
	
	Если ТипСсылкиWarehouse = Тип("СправочникСсылка.гкс_СтанцииWarehouse") Тогда
		
		Результат = Новый ОписаниеТипов("СправочникСсылка.гкс_КлассификаторСтанцийЖД");
		
	ИначеЕсли ТипСсылкиWarehouse = Тип("СправочникСсылка.гкс_ПродукцияWarehouse") Тогда
		
		Результат = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
	ИначеЕсли ТипСсылкиWarehouse = Тип("СправочникСсылка.гкс_ПоказателиКачестваWarehouse") Тогда
		
		Результат = Новый ОписаниеТипов("СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры");
		
	ИначеЕсли ТипСсылкиWarehouse = Тип("СправочникСсылка.гкс_КонтрагентыWarehouse") Тогда
		
		СоотвествиеТиповКонтрагента = Новый Соответствие;
		СоотвествиеТиповКонтрагента.Вставить(Перечисления.гкс_ТипыОбъектовWarehouse.Организация, 
			Новый ОписаниеТипов("СправочникСсылка.Организации"));
			
		СоотвествиеТиповКонтрагента.Вставить(Перечисления.гкс_ТипыОбъектовWarehouse.Сюрвейер, 
			Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
				
		СоотвествиеТиповКонтрагента.Вставить(Перечисления.гкс_ТипыОбъектовWarehouse.Элеватор, 
			Новый ОписаниеТипов("СправочникСсылка.гкс_ТочкиМаршрута"));	
		
		ТипКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаWarehouse, "ТипОбъекта");
		
		Результат = СоотвествиеТиповКонтрагента.Получить(ТипКонтрагента);	
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти
